package b_operator;

public class Operator_test {

	public static void main(String[] args) {
		
		
		//산술연산자
		//5개의 산술연산자를 사용해 5개의 연산을 수행 후 출력해주세요.
		
		//아래의 문장을 복합연산자를 사용한 문장으로 만들어주세요.
			//result = result + 10;
				
			//result = result % 5;
				
			//result = result -2 * 3;
		
		//3개의 int형 변수를 선언 및 초기화후 합계의 평균을 구해주세요.
			
		
		
		//비교 연산자
		//다음의 문장들을 코드로 작성해주세요.
			//x는 y보다 작거나 같다.
		
			//x+5와 y는 같다.
		
			//y는 홀수이다. 나머지가 0이면 짝수 1이면 홀수
		
			//"기본형"과 "참조형"은 다르다.
		
		
		//논리 연산자
		//다음의 문장들을 코드로 작성해주세요.
			//1. x가 y보다 크고 x가 10보다 작다.
				
			//2. x가 짝수이고y보다 작거나 같다.
				
			//3. x가 3의 배수이거나 5의 배수이다. hint해당수로 나누면 0이 나오면 배수값을 구할수있다.
		
		
		
		//2 개의 숫자를 입력하고 둘 중 더 큰 숫자를 출력해주세요.
		//숫자를 입력받고, 그 숫자가 1이나 3이면 남자를 2나 4면 여자를 출력해주세요.그외는 확인불가를 출력해주세요
		
				
		

	}

}
